
#Область ПрограммныйИнтерфейс

// Функция - Тех карты ЗУПСодержат вид работ в году
//
// Параметры:
//  мВидыРаботКод	 - Массив ИЗ строка - набор кодов СправочникСсылка.ВидыРаботСотрудников
//  ГодТехКарты		 - Дата - дата документа
// 
// Возвращаемое значение:
//	Ответ - Структура ИЗ
//  	*Отказ  - Булево - Если хоть один вид работ отсутствует в ЗУП.ТехКарты Тогда Истина
//		*Данные - Массив ИЗ Строка - Данные Код карточки которые отсутствуют (не найдены) в ЗУП
//
&НаСервере
Функция ТехКартыЗУПСодержатВидРаботВГоду(мВидыРаботКод, ГодТехКарты) Экспорт
	
	НовыйНастройкиПрокси 	= КП_ОбменДаннымиWS.НовыйНастройкиПрокси_Bugs_uat_zup();	
	ТекстЗапроса 			= ТекстЗапросаЗУПВидРаботВГодуСуществует();
	ГодТехКартыСтр			= Строка(Формат(ГодТехКарты, "ДФ=yyyyMMdd"));
	ПараметрыЗапроса		= Новый Структура;
	
	
	ПараметрыЗапроса.Вставить("ВидРаботКод", мВидыРаботКод);
	ПараметрыЗапроса.Вставить("ГодТехКарты", ГодТехКарты);	
	
	ТабЗначений = КП_ОбменДаннымиWS.ПослатьЗапросWS(НовыйНастройкиПрокси, ТекстЗапроса, ПараметрыЗапроса);		
	Ответ		= Новый Структура;
	ДанныхНет	= Новый Массив;
	
	Для Каждого ВидРаботКод Из мВидыРаботКод Цикл
		найден = ТабЗначений.Найти(ВидРаботКод, "ВидРаботКод");
		
		Если найден <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныхНет.Добавить(ВидРаботКод);
		
	КонецЦикла;
	
	Ответ.Вставить("Отказ",  ДанныхНет.Количество() > 0);
	Ответ.Вставить("Данные", ДанныхНет);	
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ПреобразоватьТаблицуЗначенийВМассивСтруктур

// Для передачи таблицы значений с сервера на клиента или быстрой печати используя спец. метод из шаблона.
//
// Параметры:
//   ТабЗначений - Коллекция таблица значений
//
// Возвращаемое значение:
//   массив - массив из структур
//
// Пример:
//   массивСтруктур = ПреобразоватьТаблицуЗначенийВМассивСтруктур(ТабЗначений);
//
&НаСервере
Функция ПреобразоватьТаблицуЗначенийВМассивСтруктур(ТабЗначений)
	
	Если ТабЗначений.Количество() <= 0 Тогда
		Возврат Новый Массив;
	КонецЕсли;
		
	именаКолонок = "";
	Для каждого колонка Из ТабЗначений.Колонки Цикл				
		именаКолонок = именаКолонок + ?(именаКолонок = "", "",",") + колонка.Имя;
	КонецЦикла;    
	
	ИтераторА = 0;
	массивСтруктур = Новый Массив(ТабЗначений.Количество());
	Для каждого э Из ТабЗначений Цикл
		структураДанных = Новый Структура(именаКолонок);
		Для каждого колонка Из ТабЗначений.Колонки Цикл				
			структураДанных[колонка.Имя] = э[колонка.Имя];
		КонецЦикла;
		
		массивСтруктур[ИтераторА] = структураДанных;
		ИтераторА = ИтераторА + 1;
	КонецЦикла;
	
	Возврат массивСтруктур;

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗапросДля_ТехКартыЗУПСодержатВидРаботВГоду

&НаСервере
Функция ТекстЗапросаЗУПВидРаботВГодуСуществует()
	
	ТекстЗапроса = 
	"Выбрать
	|	ВидыРабот.Ссылка,
	|	ВидыРабот.Код КАК Код
	|	ПОМЕСТИТЬ ВидыРаботВТ
	|Из
	|	Справочник.ВидыРаботСотрудников КАК ВидыРабот
	|ГДЕ
	|	ВидыРабот.Код В (&ВидРаботКод)
	|
	|;

	|Выбрать Первые 1
	|	ВидыРаботВТ.Код КАК ВидРаботКод
	|Из
	|	РегистрСведений.Массандра_НормыОбъемаРабот КАК Нормы
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВидыРаботВТ
	|	ПО Нормы.ВидРабот = ВидыРаботВТ.Ссылка
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(Нормы.Период, Год) = НАЧАЛОПЕРИОДА(&ГодТехКарты, Год)";
	
	Возврат ТекстЗапроса;

КонецФункции

#КонецОбласти

#КонецОбласти