
#Область ПрограммныйИнтерфейс

Процедура ПередПроведениемУатПутевойЛист(Источник, Отказ, РежимПроведения) Экспорт
	
#Область ЗапретПроведенияЕслиВидРаботОтсутствуетВЗУП

	тчЗаданиеТрактора = Источник._ЗаданиеТрактора;
	
	Если тчЗаданиеТрактора.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	данныеКолонкиВидыРабот 	= тчЗаданиеТрактора.ВыгрузитьКолонку("_ВидРаботы");
	мВидыРабот				= ПолучитьКодВидаРабот(данныеКолонкиВидыРабот);
	ГодТехКарты				= Источник.Дата;
	
	ЗапретПроведенияЕслиВидРаботОтсутствуетВЗУП(мВидыРабот, ГодТехКарты, Отказ);

#КонецОбласти
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Процедура - Запрет проведения документа если Вид Работ отсутствует в ЗУП
//
// Параметры:
//  мВидыРаботКод - Массив ИЗ Строка - Код карточки СправочникСсылка.ВидыРаботСотрудников
//  Отказ	      - Булево - свойство "Отказ" проводимого документа
//
Процедура ЗапретПроведенияЕслиВидРаботОтсутствуетВЗУП(мВидыРаботКод, ГодТехКарты, Отказ) Экспорт
			
	Ответ = КП_КонтрольПроведенияОбщий.ТехКартыЗУПСодержатВидРаботВГоду(мВидыРаботКод, ГодТехКарты);
	
	Если Ответ.Отказ Тогда
		Отказ = Ответ.Отказ;
		
		текстОшибки = Новый Массив;
		текстОшибки.Добавить("ru = ""Запрет проведения документа так как вид работ не найден в ЗУП""");
		Сообщить( НСтр( СтрСоединить(текстОшибки, ";") ) );
		
		Для Каждого ВидРаботКод ИЗ Ответ.Данные Цикл		
			Сообщить( ВидРаботКод );
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция - Получить код вида работ
//
// Параметры:
//  данныеКолонкиВидыРабот - Массив ИЗ Структура где Код СправочникСсылка.ВидыРаботСотрудников
// 
// Возвращаемое значение:
//  мВидыРаботКод - Массив ИЗ Строка (Код карточки виды работ)
//
Функция ПолучитьКодВидаРабот(данныеКолонкиВидыРабот)

	мВидыРаботКод = Новый Массив;
	Для Каждого текДанные Из данныеКолонкиВидыРабот Цикл
		мВидыРаботКод.Добавить(текДанные.Код);
	КонецЦикла;
	
	Возврат мВидыРаботКод;

КонецФункции

#КонецОбласти